app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    @movies = Movie.all
    redirect_needed = false
    sorting_redirect = false

    # new session
    if session.length == 0
      rating_hash = Hash.new
      @all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G')


    # perform movies query
    if @sort_type == "movie_name"
      @movies = Movie.find(@rating_ids, :order => "title ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13) ORDER BY release_date ASC